### TASK 1

In [1]:
import pandas as pd

In [2]:
persona_df = pd.read_csv('persona.csv')
persona_df

      PRICE   SOURCE     SEX COUNTRY  AGE
0        39  android    male     bra   17
1        39  android    male     bra   17
2        49  android    male     bra   17
3        29  android    male     tur   17
4        49  android    male     tur   17
...     ...      ...     ...     ...  ...
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31

[5000 rows x 5 columns]

In [3]:
persona_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [4]:
persona_df['SOURCE'].nunique()

2

In [5]:
persona_df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [6]:
persona_df['PRICE'].nunique()

6

In [7]:
persona_df['PRICE'].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

In [8]:
persona_df['COUNTRY'].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

In [9]:
persona_df[['COUNTRY', 'PRICE']].groupby('COUNTRY').sum()

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [10]:
persona_df[['SOURCE', 'PRICE']].groupby('SOURCE').count()

         PRICE
SOURCE
android   2974
ios       2026

In [11]:
persona_df[['COUNTRY', 'PRICE']].groupby('COUNTRY').mean()

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [12]:
persona_df[['SOURCE', 'PRICE']].groupby('SOURCE').mean()

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [13]:
persona_df[['COUNTRY', 'SOURCE', 'PRICE']].groupby(['COUNTRY', 'SOURCE']).mean()

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

### TASK 2

In [14]:
price_by_all_df = persona_df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).mean().round(2)
price_by_all_df.reset_index(inplace=True)
price_by_all_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android  female   15  38.71
1     bra  android  female   16  35.94
2     bra  android  female   17  35.67
3     bra  android  female   18  32.26
4     bra  android  female   19  35.21

### TASK 3

In [15]:
agg_df = price_by_all_df.sort_values('PRICE', ignore_index=True, ascending=False)
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

### TASK 4

In [16]:
# We don't need to do anything here since we reset index at task 2.
agg_df.index

RangeIndex(start=0, stop=348, step=1)

### TASK 5

In [17]:
agg_df_bins = [0, 18, 23, 30, 40, 70]
agg_df_labels = ['0_18', '19_23', '24_30', '31_40', '41_70']
agg_df['AGE_CAT'] = pd.cut(agg_df['AGE'], bins=agg_df_bins, labels= agg_df_labels)

In [18]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_70
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40

### TASK 6

In [19]:
agg_df['AGE_CAT'] = agg_df['AGE_CAT'].astype('string')
agg_df['customers_level_based'] = agg_df['COUNTRY'] + "_" + agg_df['SOURCE'] + "_" + agg_df['SEX'] + "_" + agg_df['AGE_CAT']

In [20]:
agg_df['customers_level_based'] = agg_df['customers_level_based'].apply(lambda x: x.upper())
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT     customers_level_based
0       bra  android    male   46   59.0   41_70    BRA_ANDROID_MALE_41_70
1       usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2       fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3       usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4       deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40
..      ...      ...     ...  ...    ...     ...                       ...
343     usa      ios  female   38   19.0   31_40      USA_IOS_FEMALE_31_40
344     usa      ios  female   30   19.0   24_30      USA_IOS_FEMALE_24_30
345     can  android  female   27   19.0   24_30  CAN_ANDROID_FEMALE_24_30
346     fra  android    male   18   19.0    0_18     FRA_ANDROID_MALE_0_18
347     deu  android    male   26    9.0   24_30    DEU_ANDROID_MALE_24_30

[348 rows x 7 columns]

In [45]:
persona_df = agg_df.groupby('customers_level_based')['PRICE'].mean().reset_index()
persona_df

        customers_level_based      PRICE
0     BRA_ANDROID_FEMALE_0_18  35.645000
1    BRA_ANDROID_FEMALE_19_23  34.078000
2    BRA_ANDROID_FEMALE_24_30  33.864286
3    BRA_ANDROID_FEMALE_31_40  34.900000
4    BRA_ANDROID_FEMALE_41_70  36.737500
..                        ...        ...
104         USA_IOS_MALE_0_18  33.982500
105        USA_IOS_MALE_19_23  34.900000
106        USA_IOS_MALE_24_30  34.838333
107        USA_IOS_MALE_31_40  36.206000
108        USA_IOS_MALE_41_70  35.750000

[109 rows x 2 columns]

### TASK 7

In [55]:
persona_df['SEGMENT'] = pd.qcut(persona_df['PRICE'], 4, labels=["D", "C", "B", "A"])

In [56]:
persona_df.groupby('SEGMENT').agg({'PRICE': ['mean', 'max','sum']}).reset_index().droplevel(0, axis=1)

           mean     max          sum
0  D  29.206823  32.335   817.791048
1  C  33.509418  34.078   904.754286
2  B  34.999460  36.000   944.985429
3  A  38.691284  45.430  1044.664667

### TASK 8

In [58]:
persona_df[persona_df['customers_level_based'] == 'TUR_ANDROID_FEMALE_31_40']

       customers_level_based   PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.835       A

In [59]:
persona_df[persona_df['customers_level_based'] == 'FRA_IOS_FEMALE_31_40']

   customers_level_based  PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.82       C